Invixo - RegressionTestTool/tst/resources/testfiles/com/invixo/common/util/httpPost_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:AdapterMessageMonitoringVi" xmlns:urn1="urn:com.sap.aii.mdt.server.adapterframework.ws" xmlns:urn2="urn:com.sap.aii.mdt.api.data" xmlns:lang="urn:java/lang">
   <soapenv:Body>
      <urn:getMessageList>
         <urn:filter>
            <urn1:archive>false</urn1:archive>
		  <urn1:dateType></urn1:dateType>
		  <urn1:direction>OUTBOUND</urn1:direction>

            <urn1:nodeId></urn1:nodeId>
            <urn1:onlyFaultyMessages>false</urn1:onlyFaultyMessages>
		  <urn1:qualityOfService>EO</urn1:qualityOfService>

            <urn1:retries>-1</urn1:retries>
            <urn1:retryInterval>-1</urn1:retryInterval>
            <urn1:serviceDefinition></urn1:serviceDefinition>

            <urn1:status>success</urn1:status>
            <urn1:timesFailed>-1</urn1:timesFailed>

            <urn1:wasEdited>false</urn1:wasEdited>
         </urn:filter>

         <urn:maxMessages>0</urn:maxMessages>
      </urn:getMessageList>
   </soapenv:Body>
</soapenv:Envelope>